zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_core_trng.h
/** \} group_crypto_lld_rng_functions */



/** \cond INTERNAL */

/* Macros for conditions used by CY_ASSERT calls */
#define CY_CRYPTO_IS_SMPL_CLK_DIV_VALID(clkDiv)     ((clkDiv) <= 255U)
#define CY_CRYPTO_IS_RED_CLK_DIV_VALID(clkDiv)      ((clkDiv) <= 255U)
#define CY_CRYPTO_IS_INIT_DELAY_VALID(delay)        ((delay) <= 255U)
#define CY_CRYPTO_IS_VONN_CORR_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTO_IS_AP_DETECT_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTO_IS_RC_DETECT_VALID(val)           ((uint32_t)(val) <= 1U)

#define CY_CRYPTO_IS_RO11_EN_VALID(val)             ((uint32_t)(val) <= 1U)
#define CY_CRYPTO_IS_RO15_EN_VALID(val)             ((uint32_t)(val) <= 1U)
#define CY_CRYPTO_IS_GARO15_EN_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTO_IS_GARO31_EN_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTO_IS_FIRO15_EN_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTO_IS_FIRO31_EN_VALID(val)           ((uint32_t)(val) <= 1U)

#define CY_CRYPTO_IS_GARO_POLY_VALID(val)           ((val) <= 0x7FFFFFFFUL)
#define CY_CRYPTO_IS_FIRO_POLY_VALID(val)           ((val) <= 0x7FFFFFFFUL)

#define CY_CRYPTO_IS_BS_SELECT_VALID(val)           (((val) == CY_CRYPTO_TRMON_BS_DAS) || \
                                                     ((val) == CY_CRYPTO_TRMON_BS_RED) || \
                                                     ((val) == CY_CRYPTO_TRMON_BS_TR))

#define CY_CRYPTO_IS_CCOUNT8_VALID(val)             ((val) <= 255U)
#define CY_CRYPTO_IS_CCOUNT16_VALID(val)            ((val) <= 65535U)
#define CY_CRYPTO_IS_WINSIZE_VALID(val)             ((val) <= 65535U)

#define CY_CRYPTO_TRNG_AP_DETECT_ERROR_BIT          (0U)
#define CY_CRYPTO_TRNG_RC_DETECT_ERROR_BIT          (1U)
#define CY_CRYPTO_TRNG_AP_DETECT_ERROR              (1U << 0U)
#define CY_CRYPTO_TRNG_RC_DETECT_ERROR              (1U << 1U)

#define CY_CRYPTO_TRNG_RO_ALL_MASK                  (uint32_t)(CRYPTO_TR_CTL1_RO11_EN_Msk | \
                                                     CRYPTO_TR_CTL1_RO15_EN_Msk | \
                                                     CRYPTO_TR_CTL1_GARO15_EN_Msk | CRYPTO_TR_CTL1_GARO31_EN_Msk | \
                                                     CRYPTO_TR_CTL1_FIRO15_EN_Msk | CRYPTO_TR_CTL1_FIRO31_EN_Msk)

extern const cy_stc_crypto_trng_config_t     cy_trngDefaultConfig;

/** \endcond */

__STATIC_INLINE bool Cy_Crypto_Core_Trng_IsInitialized(CRYPTO_Type *base);

__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_GetRoStatus(CRYPTO_Type *base, cy_en_crypto_trng_ro_sel_t roSelector);
__STATIC_INLINE void Cy_Crypto_Core_Trng_SetRoStatus(CRYPTO_Type *base,
                                                     cy_en_crypto_trng_ro_sel_t roSelector, uint8_t roStatus);
__STATIC_INLINE bool Cy_Crypto_Core_Trng_IsRoEnabled(CRYPTO_Type *base, cy_en_crypto_trng_ro_sel_t roSelector);
__STATIC_INLINE bool Cy_Crypto_Core_Trng_AnyRoEnabled(CRYPTO_Type *base);

__STATIC_INLINE uint32_t Cy_Crypto_Core_Trng_GetData(CRYPTO_Type *base);
__STATIC_INLINE void Cy_Crypto_Core_Trng_SetData(CRYPTO_Type *base, uint32_t randomData);

__STATIC_INLINE void Cy_Crypto_Core_Trng_SetGaroPoly(CRYPTO_Type *base, uint32_t poly);
__STATIC_INLINE void Cy_Crypto_Core_Trng_SetFiroPoly(CRYPTO_Type *base, uint32_t poly);
__STATIC_INLINE uint32_t Cy_Crypto_Core_Trng_GetGaroPoly(CRYPTO_Type *base);
__STATIC_INLINE uint32_t Cy_Crypto_Core_Trng_GetFiroPoly(CRYPTO_Type *base);

__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetHealthStatus(CRYPTO_Type *base);

__STATIC_INLINE uint8_t  Cy_Crypto_Core_Trng_MonGetRcRepCount(CRYPTO_Type *base);
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApOccCount(CRYPTO_Type *base);
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApWindowIndex(CRYPTO_Type *base);

__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetRcCurrentBit(CRYPTO_Type *base);
__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetApCurrentBit(CRYPTO_Type *base);

__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Trng_MonSetBSSelector(CRYPTO_Type *base, cy_en_crypto_trng_bs_sel_t bitStreamSelector);
__STATIC_INLINE cy_en_crypto_trng_bs_sel_t Cy_Crypto_Core_Trng_MonGetBSSelector(CRYPTO_Type *base);

__STATIC_INLINE void Cy_Crypto_Core_Trng_MonEnableApTest(CRYPTO_Type *base);
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonDisableApTest(CRYPTO_Type *base);
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonEnableRcTest(CRYPTO_Type *base);
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonDisableRcTest(CRYPTO_Type *base);

__STATIC_INLINE void Cy_Crypto_Core_Trng_MonSetRcCC8(CRYPTO_Type *base, uint8_t ccCount);
__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetRcCC8(CRYPTO_Type *base);

__STATIC_INLINE void Cy_Crypto_Core_Trng_MonSetApCC16(CRYPTO_Type *base, uint16_t ccCount);
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApCC16(CRYPTO_Type *base);

__STATIC_INLINE void Cy_Crypto_Core_Trng_MonSetApWinSize(CRYPTO_Type *base, uint16_t windowSize);
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApWinSize(CRYPTO_Type *base);

__STATIC_INLINE void Cy_Crypto_Core_Trng_WaitForReady(CRYPTO_Type *base);
__STATIC_INLINE void Cy_Crypto_Core_Trng_WaitForComplete(CRYPTO_Type *base);

/*
 * API Implementations
 */

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_IsReady
****************************************************************************//**
*
* Checks for TRNG hardware is ready.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* true when TRNG hardware is ready, otherwise false.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Crypto_Core_Trng_IsReady(CRYPTO_Type *base)
{
    bool status = false;

    /* Check for TRNG instruction is complete */
    if (CY_CRYPTO_V1)
    {
        #if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        status = (0uL == (REG_CRYPTO_STATUS(base) & CRYPTO_STATUS_TR_BUSY_Msk));
        #endif
    }
    else
    {
        #if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        status = (0uL == _FLD2VAL(CRYPTO_V2_STATUS_BUSY, REG_CRYPTO_STATUS(base)));
        #endif
    }

