zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_core_trng.h
/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetApOccCount
****************************************************************************//**
*
* Reads the current Cutoff count number from the adaptive proportion
* test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The Cutoff count number of the adaptive proportion test.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApOccCount(CRYPTO_Type *base)
{
    return ((uint16_t)_FLD2VAL(CRYPTO_TR_MON_AP_STATUS1_OCC_COUNT, REG_CRYPTO_TR_MON_AP_STATUS1(base)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetApWindowIndex
****************************************************************************//**
*
* Reads the current window index from the adaptive proportion test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The window index of the adaptive proportion test.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApWindowIndex(CRYPTO_Type *base)
{
    return ((uint16_t)_FLD2VAL(CRYPTO_TR_MON_AP_STATUS1_WINDOW_INDEX, REG_CRYPTO_TR_MON_AP_STATUS1(base)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetRcCurrentBit
****************************************************************************//**
*
* Reads the active bit value from the adaptive proportion test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The active bit value.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetRcCurrentBit(CRYPTO_Type *base)
{
    return ((uint8_t)_FLD2VAL(CRYPTO_TR_MON_RC_STATUS0_BIT, REG_CRYPTO_TR_MON_RC_STATUS0(base)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetApCurrentBit
****************************************************************************//**
*
* Reads the active bit value from the repetition counter test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The active bit value.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetApCurrentBit(CRYPTO_Type *base)
{
    return ((uint8_t)_FLD2VAL(CRYPTO_TR_MON_AP_STATUS0_BIT, REG_CRYPTO_TR_MON_AP_STATUS0(base)));
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonSetBSSelector
****************************************************************************//**
*
* Sets the BitStream selector value of the TRNG monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param bitStreamSelector
* The BitStream selector value (see \ref cy_en_crypto_trng_bs_sel_t).
*
*******************************************************************************/
__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Trng_MonSetBSSelector(CRYPTO_Type *base,
                                                                           cy_en_crypto_trng_bs_sel_t bitStreamSelector)
{
    cy_en_crypto_status_t status = CY_CRYPTO_SUCCESS;

    CY_ASSERT_L3(CY_CRYPTO_IS_BS_SELECT_VALID(bitStreamSelector));

    CY_REG32_CLR_SET(REG_CRYPTO_TR_MON_CTL(base), CRYPTO_TR_MON_CTL_BITSTREAM_SEL, bitStreamSelector);

    return status;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetBSSelector
****************************************************************************//**
*
* Reads the BitStream selector value of the TRNG monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The BitStream selector value (see \ref cy_en_crypto_trng_bs_sel_t).
*
*******************************************************************************/
__STATIC_INLINE cy_en_crypto_trng_bs_sel_t Cy_Crypto_Core_Trng_MonGetBSSelector(CRYPTO_Type *base)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_crypto_trng_bs_sel_t enum.');
    return ((cy_en_crypto_trng_bs_sel_t)_FLD2VAL(CRYPTO_TR_MON_CTL_BITSTREAM_SEL, REG_CRYPTO_TR_MON_CTL(base)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonEnableApTest
****************************************************************************//**
*
* Enables the Adaptive proportion (AP) test.
*
* \param base
* The pointer to the CRYPTO instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonEnableApTest(CRYPTO_Type *base)
{
    CY_REG32_CLR_SET(REG_CRYPTO_TR_MON_CMD(base), CRYPTO_TR_MON_CMD_START_AP, 1U);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonDisableApTest
****************************************************************************//**
*
* Disables the Adaptive proportion (AP) test.
*
* \param base
* The pointer to the CRYPTO instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonDisableApTest(CRYPTO_Type *base)
{
    CY_REG32_CLR_SET(REG_CRYPTO_TR_MON_CMD(base), CRYPTO_TR_MON_CMD_START_AP, 0U);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonEnableRcTest
****************************************************************************//**
*
* Enables the Repetition count (RC) test.
*
* \param base
* The pointer to the CRYPTO instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonEnableRcTest(CRYPTO_Type *base)
{
    CY_REG32_CLR_SET(REG_CRYPTO_TR_MON_CMD(base), CRYPTO_TR_MON_CMD_START_RC, 1U);
}

